package com.nhnacademy.practice_problems_4;

public class Main {
    public static void main(String[] args) {
        //####문제 4: 데이터와 메서드를 함께 묶는 장점이 아닌 것은?
        /*
        (A) 관련된 것들이 한 곳에 모여 있어 이해하기 쉽다 :  응집도 향상 - 관련된 데이터와 동작이 함께 있어 이해하기 쉬움
        (B) 프로그램 실행 속도가 빨라진다 : ❌ 실행 속도와는 관련 없음 (코드 구조/설계의 장점)
        (C) 데이터를 잘못 사용하는 것을 방지할 수 있다 : 캡슐화 - 메서드를 통해서만 데이터에 접근하게 하여 잘못된 사용 방지
        (D) 클래스 단위로 다른 프로그램에서 재사용할 수 있다 : 재사용성 - 클래스를 다른 프로젝트에서 그대로 사용 가능
        
        정답 : B
        */
    }
}
